### Terraform Plan for Test 🔍

<details>
<summary>Show Plan</summary>

```terraform
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.app.aws_route53_record.design_vy_no must be replaced
-/+ resource "aws_route53_record" "design_vy_no" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "test.design.vy.no" -> (known after apply)
      ~ id                               = "Z073886326GV5R5CSR046_test.design.vy.no_CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "test.design.vy.no"
      ~ zone_id                          = "Z073886326GV5R5CSR046" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.app.aws_route53_zone.design_vy_no must be replaced
-/+ resource "aws_route53_zone" "design_vy_no" {
      ~ arn                 = "arn:aws:route53:::hostedzone/Z073886326GV5R5CSR046" -> (known after apply)
      ~ id                  = "Z073886326GV5R5CSR046" -> (known after apply)
      ~ name                = "design.vy.no" -> "test.design.vy.no" # forces replacement
      ~ name_servers        = [
          - "ns-1116.awsdns-11.org",
          - "ns-1939.awsdns-50.co.uk",
          - "ns-464.awsdns-58.com",
          - "ns-912.awsdns-50.net",
        ] -> (known after apply)
      ~ primary_name_server = "ns-464.awsdns-58.com" -> (known after apply)
      - tags                = {} -> null
      ~ zone_id             = "Z073886326GV5R5CSR046" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Warning: Redundant ignore_changes element

  on .terraform/modules/app.preview_url/main.tf line 111, in resource "aws_lambda_function" "lambda_function":
 111: resource "aws_lambda_function" "lambda_function" {

Adding an attribute name to ignore_changes tells Terraform to ignore future
changes to the argument in configuration after the object has been created,
retaining the value originally configured.

The attribute qualified_arn is decided by the provider alone and therefore
there can be no configured value to compare with. Including this attribute in
ignore_changes has no effect. Remove the attribute from ignore_changes to
quiet this warning.

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*For commit 35c720cb590870fa8e4301c1c01eb611bca94645*
*Plan generated at: 2025-10-16 11:35:47 UTC*
